Revit 2024 API
AppearanceAssetEditScope Methods
The AppearanceAssetEditScope type exposes the following members.
Methods
Name | Description
Cancel
 Cancels the edit scope.
Commit
 Finishes the edit scope.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Start
 Starts the edit scope.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace